   05 CNT-ACCOUNTS-READ    PIC 9(7) VALUE ZERO.
   05 CNT-TRANS-READ       PIC 9(7) VALUE ZERO.
   05 CNT-TRANS-OK         PIC 9(7) VALUE ZERO.
   05 CNT-TRANS-ERR        PIC 9(7) VALUE ZERO.
   05 AMT-DEBIT-TOTAL      PIC 9(11)V99 VALUE ZERO.
   05 AMT-CREDIT-TOTAL     PIC 9(11)V99 VALUE ZERO.
