   05 RES-TRN-ID           PIC X(12).
   05 RES-ACCOUNT-ID       PIC X(10).
   05 RES-TYPE             PIC X(01).
   05 RES-AMOUNT           PIC 9(11)V99.
   05 RES-CURRENCY         PIC X(03).
   05 RES-NEW-BALANCE      PIC 9(11)V99.
   05 RES-STATUS           PIC X(10).
   05 RES-MESSAGE          PIC X(20).
