   05 TRN-ID               PIC X(12).
   05 TRN-DATE             PIC 9(08).
   05 TRN-ACCOUNT-ID       PIC X(10).
   05 TRN-TYPE             PIC X(01).
   05 TRN-AMOUNT           PIC 9(11)V99.
   05 TRN-CURRENCY         PIC X(03).
   05 TRN-CHANNEL          PIC X(10).
   05 TRN-DESC             PIC X(20).
